---
permalink: flexgroup/shrink-flexgroup-volume-task.html 
sidebar: sidebar 
keywords: reduce, size, flexgroup, volume, flex group, resize, shrink, shrinking, autosize 
summary: 從ONTAP 功能性的9.6開始、FlexGroup 您可以將一個不符合目前大小的值重新調整成低於目前大小的值、以便從磁碟區中釋出未使用的空間。當您縮小FlexGroup 一個等量資料量時ONTAP 、系統會自動重新調整FlexGroup 所有的候數資料。 
---
= 縮小FlexGroup 一個不全的體積
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
從ONTAP 功能性的9.6開始、FlexGroup 您可以將一個不符合目前大小的值重新調整成低於目前大小的值、以便從磁碟區中釋出未使用的空間。當您縮小FlexGroup 一個等量資料量時ONTAP 、系統會自動重新調整FlexGroup 所有的候數資料。

.步驟
. 檢查目前FlexGroup 的動態區大小：「Volume size -vserver _vserver_name_-volume _fa_name_」
. 縮小FlexGroup 不必要的資料量： `volume size -vserver _vserver_name_ -volume _fg_name_ _new_size_`
+
當您指定新的大小時、可以使用減號（-）來指定低於目前大小的值、或使用減號（-）來減少FlexGroup 目前的大小。

+
[NOTE]
====
如果已啟用Volume的自動壓縮（「volume autossize'命令）、則最小自動調整大小會設為新的Volume大小。

====
+
下列範例顯示FlexGroup 名為volX的目前流通量大小、並將磁碟區大小重新調整為10TB：

+
[listing]
----
cluster1::> volume size -vserver svm1 -volume volX
(volume size)
vol size: FlexGroup volume 'svm1:volX' has size 15TB.

cluster1::> volume size -vserver svm1 -volume volX 10TB
(volume size)
vol size: FlexGroup volume 'svm1:volX' size set to 10TB.
----
+
下列範例顯示FlexGroup 名為volX的目前流通量大小、並將此磁碟區的大小減少5TB：

+
[listing]
----
cluster1::> volume size -vserver svm1 -volume volX
(volume size)
vol size: FlexGroup volume 'svm1:volX' has size 15TB.

cluster1::> volume size -vserver svm1 -volume volX -5TB
(volume size)
vol size: FlexGroup volume 'svm1:volX' size set to 10TB.
----

