---
permalink: system-admin/manage-ip-addresses-access-sp-task.html 
sidebar: sidebar 
keywords: manage, ip, addresses, access, sp, ssh, connection, node, cluster 
summary: 依預設、SP會接受來自任何IP位址管理主機的SSH連線要求。您可以將SP設定為僅接受來自您指定IP位址之管理主機的SSH連線要求。您所做的變更會套用至叢集中任何節點的SP存取SSH。 
---
= 管理可存取SP的IP位址
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
依預設、SP會接受來自任何IP位址管理主機的SSH連線要求。您可以將SP設定為僅接受來自您指定IP位址之管理主機的SSH連線要求。您所做的變更會套用至叢集中任何節點的SP存取SSH。

.步驟
. 僅將 SP 存取權授予您使用指定的 IP 位址 `system service-processor ssh add-allowed-addresses` 命令 `-allowed-addresses` 參數。
+
** 的值 `-allowed-addresses` 參數必須以的格式指定 `address`/`netmask`和多個 `address`/`netmask` 配對必須以逗號分隔、例如 `10.98.150.10/24, fd20:8b1e:b255:c09b::/64`。
+
設定 `-allowed-addresses` 參數至 `0.0.0.0/0, ::/0` 啟用所有 IP 位址以存取 SP （預設）。

** 當您只將 SP 存取限制為指定的 IP 位址來變更預設值時、 ONTAP 會提示您確認是否要指定的 IP 位址取代「允許所有」的預設設定 (`0.0.0.0/0, ::/0`）。
** 。 `system service-processor ssh show` 命令會顯示可存取 SP 的 IP 位址。


. 如果您要封鎖指定的 IP 位址、使其無法存取 SP 、請使用 `system service-processor ssh remove-allowed-addresses` 命令 `-allowed-addresses` 參數。
+
如果您封鎖所有IP位址、使其無法從任何管理主機存取SP。



.管理可存取SP的IP位址範例
下列範例顯示SSH存取SP的預設設定、將SP存取限制為僅指定IP位址、從存取清單中移除指定的IP位址、然後還原所有IP位址的SP存取：

[listing]
----
cluster1::> system service-processor ssh show
  Allowed Addresses: 0.0.0.0/0, ::/0

cluster1::> system service-processor ssh add-allowed-addresses -allowed-addresses 192.168.1.202/24, 192.168.10.201/24

Warning: The default "allow all" setting (0.0.0.0/0, ::/0) will be replaced
         with your changes. Do you want to continue? {y|n}: y

cluster1::> system service-processor ssh show
  Allowed Addresses: 192.168.1.202/24, 192.168.10.201/24

cluster1::> system service-processor ssh remove-allowed-addresses -allowed-addresses 192.168.1.202/24, 192.168.10.201/24

Warning: If all IP addresses are removed from the allowed address list, all IP
         addresses will be denied access. To restore the "allow all" default,
         use the "system service-processor ssh add-allowed-addresses
         -allowed-addresses 0.0.0.0/0, ::/0" command. Do you want to continue?
          {y|n}: y

cluster1::> system service-processor ssh show
  Allowed Addresses: -

cluster1::> system service-processor ssh add-allowed-addresses -allowed-addresses 0.0.0.0/0, ::/0

cluster1::> system service-processor ssh show
  Allowed Addresses: 0.0.0.0/0, ::/0
----